using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Sea_Battle
{
    class Program
    {
        static void Main(string[] args)
        {
            #region StartScreen
            Console.WriteLine(
                                 @" 
                    _           _   _   _           _     _       
                   | |         | | | | | |         | |   (_)      
                   | |__   __ _| |_| |_| | ___  ___| |__  _ _ __  
                   | '_ \ / _` | __| __| |/ _ \/ __| '_ \| | '_ \ 
                   | |_) | (_| | |_| |_| |  __/\__ \ | | | | |_) |
                   |_.__/ \__,_|\__|\__|_|\___||___/_| |_|_| .__/ 
                                                           | |    
                                                           |_|    

                                       |__
                                       |\/
                                       ---
                                       / | [
                                !      | |||
                              _/|     _/|-++'
                          +  +--|    |--|--|_ |-
                       { /|__|  |/\__|  |--- |||__/
                      +---------------___[}-_===_.'____                 /\
                  ____`-' ||___-{]_| _[}-  |     |_[___\==--            \/   _
   __..._____--==/___]_|__|_____________________________[___\==--____,------' .7
  |                                                                     BB-61/
   \_________________________________________________________________________|

                ------------------------------------------------
                   Для продолжения нажмите на любую клавишу...");
            #endregion

            Game game = new Game();
            game.PassAndReceive(); ;
        }
    }
}
